In [1]:
import pandas as pd

In [13]:
sheet_names=pd.read_excel("excel.xlsx")
sheet_names

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11
0,NaN,C1,C2,C3,C4,C5,C6,NaN,NaN,SalesRep,Value,Date
1,NaN,SalesRep,A,B,C,D,E,NaN,NaN,A,18,2015-02-13 00:00:00
2,NaN,Value,18,14,19,17,13,NaN,NaN,B,14,2015-01-13 00:00:00
3,NaN,Date,2015-02-13 00:00:00,2015-01-13 00:00:00,2015-04-01 00:00:00,2015-03-04 00:00:00,2015-02-05 00:00:00,NaN,NaN,C,19,2015-04-01 00:00:00
4,NaN,SalesRep,A,B,C,D,E,NaN,NaN,D,17,2015-03-04 00:00:00
5,NaN,Value,19,10,11,11,20,NaN,NaN,E,13,2015-02-05 00:00:00
6,NaN,Date,2015-03-27 00:00:00,2015-04-06 00:00:00,2015-03-18 00:00:00,2015-02-28 00:00:00,2014-12-31 00:00:00,NaN,NaN,A,19,2015-03-27 00:00:00
7,NaN,SalesRep,A,B,C,D,E,NaN,NaN,B,10,2015-04-06 00:00:00
8,NaN,Value,15,20,11,15,10,NaN,NaN,C,11,2015-03-18 00:00:00
9,NaN,Date,2015-02-03 00:00:00,2015-02-06 00:00:00,2015-04-06 00:00:00,2015-01-03 00:00:00,2015-01-05 00:00:00,NaN,NaN,D,11,2015-02-28 00:00:00
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,E,20,2014-12-31 00:00:00
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,A,15,2015-02-03 00:00:00
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,B,20,2015-02-06 00:00:00
13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,C,11,2015-04-06 00:00:00
14,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,D,15,2015-01-03 00:00:00
15,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,E,10,2015-01-05 00:00:00

In [ ]:
#pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2/2 [openpyxl]1/2 [openpyxl]
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

In [ ]:
type(sheet_names)

pandas.core.frame.DataFrame

In [20]:
all_sheets=pd.read_excel("excel.xlsx",sheet_name="Sheet1")
all_sheets

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11
0,NaN,C1,C2,C3,C4,C5,C6,NaN,NaN,SalesRep,Value,Date
1,NaN,SalesRep,A,B,C,D,E,NaN,NaN,A,18,2015-02-13 00:00:00
2,NaN,Value,18,14,19,17,13,NaN,NaN,B,14,2015-01-13 00:00:00
3,NaN,Date,2015-02-13 00:00:00,2015-01-13 00:00:00,2015-04-01 00:00:00,2015-03-04 00:00:00,2015-02-05 00:00:00,NaN,NaN,C,19,2015-04-01 00:00:00
4,NaN,SalesRep,A,B,C,D,E,NaN,NaN,D,17,2015-03-04 00:00:00
5,NaN,Value,19,10,11,11,20,NaN,NaN,E,13,2015-02-05 00:00:00
6,NaN,Date,2015-03-27 00:00:00,2015-04-06 00:00:00,2015-03-18 00:00:00,2015-02-28 00:00:00,2014-12-31 00:00:00,NaN,NaN,A,19,2015-03-27 00:00:00
7,NaN,SalesRep,A,B,C,D,E,NaN,NaN,B,10,2015-04-06 00:00:00
8,NaN,Value,15,20,11,15,10,NaN,NaN,C,11,2015-03-18 00:00:00
9,NaN,Date,2015-02-03 00:00:00,2015-02-06 00:00:00,2015-04-06 00:00:00,2015-01-03 00:00:00,2015-01-05 00:00:00,NaN,NaN,D,11,2015-02-28 00:00:00
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,E,20,2014-12-31 00:00:00
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,A,15,2015-02-03 00:00:00
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,B,20,2015-02-06 00:00:00
13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,C,11,2015-04-06 00:00:00
14,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,D,15,2015-01-03 00:00:00
15,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,E,10,2015-01-05 00:00:00

In [16]:
pd.ExcelFile("excel.xlsx").sheet_names

['Sheet1', 'Sheet2', 'Sheet3']

In [24]:
columns = [i for i in range(12)]

In [25]:
columns

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

In [26]:
all_sheets.columns=columns

In [28]:
temp=all_sheets.iloc[0:10,1:7] # row and column respectively

In [29]:
temp

,1,2,3,4,5,6
0,C1,C2,C3,C4,C5,C6
1,SalesRep,A,B,C,D,E
2,Value,18,14,19,17,13
3,Date,2015-02-13 00:00:00,2015-01-13 00:00:00,2015-04-01 00:00:00,2015-03-04 00:00:00,2015-02-05 00:00:00
4,SalesRep,A,B,C,D,E
5,Value,19,10,11,11,20
6,Date,2015-03-27 00:00:00,2015-04-06 00:00:00,2015-03-18 00:00:00,2015-02-28 00:00:00,2014-12-31 00:00:00
7,SalesRep,A,B,C,D,E
8,Value,15,20,11,15,10
9,Date,2015-02-03 00:00:00,2015-02-06 00:00:00,2015-04-06 00:00:00,2015-01-03 00:00:00,2015-01-05 00:00:00

In [35]:
temp=temp.iloc[1:,]

In [36]:
temp

,1,2,3,4,5,6
1,SalesRep,A,B,C,D,E
2,Value,18,14,19,17,13
3,Date,2015-02-13 00:00:00,2015-01-13 00:00:00,2015-04-01 00:00:00,2015-03-04 00:00:00,2015-02-05 00:00:00
4,SalesRep,A,B,C,D,E
5,Value,19,10,11,11,20
6,Date,2015-03-27 00:00:00,2015-04-06 00:00:00,2015-03-18 00:00:00,2015-02-28 00:00:00,2014-12-31 00:00:00
7,SalesRep,A,B,C,D,E
8,Value,15,20,11,15,10
9,Date,2015-02-03 00:00:00,2015-02-06 00:00:00,2015-04-06 00:00:00,2015-01-03 00:00:00,2015-01-05 00:00:00

In [38]:
sales_rep=temp.iloc[::3,]

In [39]:
sales_rep

          1  2  3  4  5  6
1  SalesRep  A  B  C  D  E
4  SalesRep  A  B  C  D  E
7  SalesRep  A  B  C  D  E

In [41]:
value=temp.iloc[1::3,]

In [42]:
value

       1   2   3   4   5   6
2  Value  18  14  19  17  13
5  Value  19  10  11  11  20
8  Value  15  20  11  15  10

In [44]:
date=temp.iloc[2::3,]

In [45]:
date

,1,2,3,4,5,6
3,Date,2015-02-13 00:00:00,2015-01-13 00:00:00,2015-04-01 00:00:00,2015-03-04 00:00:00,2015-02-05 00:00:00
6,Date,2015-03-27 00:00:00,2015-04-06 00:00:00,2015-03-18 00:00:00,2015-02-28 00:00:00,2014-12-31 00:00:00
9,Date,2015-02-03 00:00:00,2015-02-06 00:00:00,2015-04-06 00:00:00,2015-01-03 00:00:00,2015-01-05 00:00:00

In [46]:
import numpy as np

In [73]:
arr=np.array(temp)

In [74]:
arr

array([['SalesRep', 'A', 'B', 'C', 'D', 'E'],
       ['Value', 18, 14, 19, 17, 13],
       ['Date', datetime.datetime(2015, 2, 13, 0, 0),
        datetime.datetime(2015, 1, 13, 0, 0),
        datetime.datetime(2015, 4, 1, 0, 0),
        datetime.datetime(2015, 3, 4, 0, 0),
        datetime.datetime(2015, 2, 5, 0, 0)],
       ['SalesRep', 'A', 'B', 'C', 'D', 'E'],
       ['Value', 19, 10, 11, 11, 20],
       ['Date', datetime.datetime(2015, 3, 27, 0, 0),
        datetime.datetime(2015, 4, 6, 0, 0),
        datetime.datetime(2015, 3, 18, 0, 0),
        datetime.datetime(2015, 2, 28, 0, 0),
        datetime.datetime(2014, 12, 31, 0, 0)],
       ['SalesRep', 'A', 'B', 'C', 'D', 'E'],
       ['Value', 15, 20, 11, 15, 10],
       ['Date', datetime.datetime(2015, 2, 3, 0, 0),
        datetime.datetime(2015, 2, 6, 0, 0),
        datetime.datetime(2015, 4, 6, 0, 0),
        datetime.datetime(2015, 1, 3, 0, 0),
        datetime.datetime(2015, 1, 5, 0, 0)]], dtype=object)

In [75]:
np.vsplit(arr,3)

[array([['SalesRep', 'A', 'B', 'C', 'D', 'E'],
        ['Value', 18, 14, 19, 17, 13],
        ['Date', datetime.datetime(2015, 2, 13, 0, 0),
         datetime.datetime(2015, 1, 13, 0, 0),
         datetime.datetime(2015, 4, 1, 0, 0),
         datetime.datetime(2015, 3, 4, 0, 0),
         datetime.datetime(2015, 2, 5, 0, 0)]], dtype=object),
 array([['SalesRep', 'A', 'B', 'C', 'D', 'E'],
        ['Value', 19, 10, 11, 11, 20],
        ['Date', datetime.datetime(2015, 3, 27, 0, 0),
         datetime.datetime(2015, 4, 6, 0, 0),
         datetime.datetime(2015, 3, 18, 0, 0),
         datetime.datetime(2015, 2, 28, 0, 0),
         datetime.datetime(2014, 12, 31, 0, 0)]], dtype=object),
 array([['SalesRep', 'A', 'B', 'C', 'D', 'E'],
        ['Value', 15, 20, 11, 15, 10],
        ['Date', datetime.datetime(2015, 2, 3, 0, 0),
         datetime.datetime(2015, 2, 6, 0, 0),
         datetime.datetime(2015, 4, 6, 0, 0),
         datetime.datetime(2015, 1, 3, 0, 0),
         datetime.datetime(2015, 1, 5, 0, 0)]], dtype=object)]

In [76]:
np.vsplit(arr,3)[0].T

array([['SalesRep', 'Value', 'Date'],
       ['A', 18, datetime.datetime(2015, 2, 13, 0, 0)],
       ['B', 14, datetime.datetime(2015, 1, 13, 0, 0)],
       ['C', 19, datetime.datetime(2015, 4, 1, 0, 0)],
       ['D', 17, datetime.datetime(2015, 3, 4, 0, 0)],
       ['E', 13, datetime.datetime(2015, 2, 5, 0, 0)]], dtype=object)

In [77]:
lists=pd.DataFrame(np.vsplit(arr,3)[2].T).iloc[0].tolist()

In [78]:
lists

['SalesRep', 'Value', 'Date']

In [79]:
pd.DataFrame(np.vsplit(arr,3)[2].T)

          0      1                    2
0  SalesRep  Value                 Date
1         A     15  2015-02-03 00:00:00
2         B     20  2015-02-06 00:00:00
3         C     11  2015-04-06 00:00:00
4         D     15  2015-01-03 00:00:00
5         E     10  2015-01-05 00:00:00

In [ ]:

dfs=[]
for array in arrs:
    .DataFrame(np.vsplit(arr,3)[2].T)
    print("############")

In [95]:
sheets1=pd.read_excel("excel.xlsx",sheet_name="Sheet2")

In [92]:
columns1=[i for i in range(12)]

In [97]:
temp2=sheets1.iloc[0:7,1:9]

In [98]:
temp2

,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,NaN,Company A,NaN,NaN,Company B,NaN,NaN,NaN
1,Bz,Finance,Sales,HR,Finance,Sales,HR,Ops
2,A,8,29,9,15,22,10,29
3,B,12,23,2,11,47,13,18
4,C,9,11,7,10,23,6,28
5,D,12,25,9,19,34,14,22
6,E,11,24,5,19,35,9,23

In [ ]:
np.hsplit(arr2,2)

In [ ]:
dfs=[]

for item in arr:
dfs.append(pd.DateFrame(item))